In [1]:
#creating dataframes using different methods
import pandas as pd

data= {
    "Name": ["Aarav","Isha","Vivaan","Priya","Reyansh"],
    "Age": [20,21,22,23,24],
    "Grade": ["A","B","A","C","B"],
    "City": ["Delhi","Mumbai","Banglore","Chennai","Hyderabad"]
}

In [2]:
data

{'Name': ['Aarav', 'Isha', 'Vivaan', 'Priya', 'Reyansh'],
 'Age': [20, 21, 22, 23, 24],
 'Grade': ['A', 'B', 'A', 'C', 'B'],
 'City': ['Delhi', 'Mumbai', 'Banglore', 'Chennai', 'Hyderabad']}

In [3]:
df= pd.DataFrame(data)

In [4]:
df

      Name  Age Grade       City
0    Aarav   20     A      Delhi
1     Isha   21     B     Mumbai
2   Vivaan   22     A   Banglore
3    Priya   23     C    Chennai
4  Reyansh   24     B  Hyderabad

In [5]:
#creating manually

names =  ["Aarav","Isha","Vivaan","Priya","Reyansh"]
ages = [20,21,22,23,24]
grades = ["A","B","A","C","B"]
cities = ["Delhi","Mumbai","Banglore","Chennai","Hyderabad"]

In [6]:
names

['Aarav', 'Isha', 'Vivaan', 'Priya', 'Reyansh']

In [7]:
df = pd.DataFrame(list(zip(names, ages, grades, cities)), columns= ["Name","Age","Grade","City"])

In [8]:
df

      Name  Age Grade       City
0    Aarav   20     A      Delhi
1     Isha   21     B     Mumbai
2   Vivaan   22     A   Banglore
3    Priya   23     C    Chennai
4  Reyansh   24     B  Hyderabad

In [9]:
#using numpy array method
import numpy as np

names = np.array(["Aarav","Isha","Vivaan","Priya","Reyansh"])
ages = np.array([20,21,22,23,24])
grades = np.array(["A","B","A","C","B"])
cities = np.array(["Delhi","Mumbai","Banglore","Chennai","Hyderabad"])

In [10]:
df= pd.DataFrame({
    "Name": names,
    "Age" : ages,
    "Grade" : grades,
    "City" : cities
})

In [11]:
df

      Name  Age Grade       City
0    Aarav   20     A      Delhi
1     Isha   21     B     Mumbai
2   Vivaan   22     A   Banglore
3    Priya   23     C    Chennai
4  Reyansh   24     B  Hyderabad

In [12]:
#using dictionary
data= {
    "Name": ["Aarav","Isha","Vivaan","Priya","Reyansh"],
    "Age": [20,21,22,23,24],
    "Grade": ["A","B","A","C","B"],
    "City": ["Delhi","Mumbai","Banglore","Chennai","Hyderabad"]
}

df= pd.DataFrame.from_dict(data)
df

      Name  Age Grade       City
0    Aarav   20     A      Delhi
1     Isha   21     B     Mumbai
2   Vivaan   22     A   Banglore
3    Priya   23     C    Chennai
4  Reyansh   24     B  Hyderabad

In [13]:
#using list of dictionaries
data = [
    {"Name":"Aarav","Age":20,"Grade":"A","City":"Delhi"},
    {"Name":"Isha","Age":21,"Grade":"B","City":"Mumbai"},
    {"Name":"Vivaan","Age":22,"Grade":"A","City":"Bangalore"},
    {"Name":"Priya","Age":23,"Grade":"C","City":"Chennai"},
    {"Name":"Reyansh","Age":24,"Grade":"B","City":"Hyderabad"}
]

df = pd.DataFrame(data)
df

      Name  Age Grade       City
0    Aarav   20     A      Delhi
1     Isha   21     B     Mumbai
2   Vivaan   22     A  Bangalore
3    Priya   23     C    Chennai
4  Reyansh   24     B  Hyderabad

In [19]:
rows,columns=df.shape

In [20]:
rows

5

In [21]:
df[["Name","Age"]][df["Grade"]=="A"]

     Name  Age
0   Aarav   20
2  Vivaan   22

In [22]:
df[["Name","Age"]][df["Age"]==df["Age"].max()]

      Name  Age
4  Reyansh   24

In [24]:
df

      Name  Age Grade       City
0    Aarav   20     A      Delhi
1     Isha   21     B     Mumbai
2   Vivaan   22     A  Bangalore
3    Priya   23     C    Chennai
4  Reyansh   24     B  Hyderabad

In [25]:
df.set_index("Name", inplace=True)

In [26]:
df

         Age Grade       City
Name
Aarav     20     A      Delhi
Isha      21     B     Mumbai
Vivaan    22     A  Bangalore
Priya     23     C    Chennai
Reyansh   24     B  Hyderabad

In [27]:
df.reset_index()

      Name  Age Grade       City
0    Aarav   20     A      Delhi
1     Isha   21     B     Mumbai
2   Vivaan   22     A  Bangalore
3    Priya   23     C    Chennai
4  Reyansh   24     B  Hyderabad